Revit 2027 API
Document.NewSlabEdge(SlabEdgeType, Reference) Method
Creates a slab edge along a reference.
Namespace: Autodesk.Revit.Creation
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public SlabEdge NewSlabEdge(
	SlabEdgeType SlabEdgeType,
	Reference reference
)
Public Function NewSlabEdge (
	SlabEdgeType As SlabEdgeType,
	reference As Reference
) As SlabEdge
public:
SlabEdge^ NewSlabEdge(
	SlabEdgeType^ SlabEdgeType,
	Reference^ reference
)
member NewSlabEdge :
        SlabEdgeType : SlabEdgeType *
        reference : Reference -> SlabEdge
Parameters
SlabEdgeType SlabEdgeType
 The type of the slab edge to create
reference Reference
 A planar line or arc that represents the place where you want to place the slab edge.
Return Value
SlabEdge
 If successful a new slab edge object within the project, otherwise null.
Exceptions
Exception | Condition
ArgumentException | Thrown if the slab edge type does not exist in the given document.
See Also
Reference
Document Class
NewSlabEdge Overload
Autodesk.Revit.Creation Namespace